GopalSaraf/Practicals/PSDL/include/proc/pic18lf25j50.inc
// Register: ANCON0
#define ANCON0 ANCON0
ANCON0                                   equ 0F48h
// bitfield definitions
ANCON0_PCFG0_POSN                        equ 0000h
ANCON0_PCFG0_POSITION                    equ 0000h
ANCON0_PCFG0_SIZE                        equ 0001h
ANCON0_PCFG0_LENGTH                      equ 0001h
ANCON0_PCFG0_MASK                        equ 0001h
ANCON0_PCFG1_POSN                        equ 0001h
ANCON0_PCFG1_POSITION                    equ 0001h
ANCON0_PCFG1_SIZE                        equ 0001h
ANCON0_PCFG1_LENGTH                      equ 0001h
ANCON0_PCFG1_MASK                        equ 0002h
ANCON0_PCFG2_POSN                        equ 0002h
ANCON0_PCFG2_POSITION                    equ 0002h
ANCON0_PCFG2_SIZE                        equ 0001h
ANCON0_PCFG2_LENGTH                      equ 0001h
ANCON0_PCFG2_MASK                        equ 0004h
ANCON0_PCFG3_POSN                        equ 0003h
ANCON0_PCFG3_POSITION                    equ 0003h
ANCON0_PCFG3_SIZE                        equ 0001h
ANCON0_PCFG3_LENGTH                      equ 0001h
ANCON0_PCFG3_MASK                        equ 0008h
ANCON0_PCFG4_POSN                        equ 0004h
ANCON0_PCFG4_POSITION                    equ 0004h
ANCON0_PCFG4_SIZE                        equ 0001h
ANCON0_PCFG4_LENGTH                      equ 0001h
ANCON0_PCFG4_MASK                        equ 0010h

// Register: ANCON1
#define ANCON1 ANCON1
ANCON1                                   equ 0F49h
// bitfield definitions
ANCON1_PCFG8_POSN                        equ 0000h
ANCON1_PCFG8_POSITION                    equ 0000h
ANCON1_PCFG8_SIZE                        equ 0001h
ANCON1_PCFG8_LENGTH                      equ 0001h
ANCON1_PCFG8_MASK                        equ 0001h
ANCON1_PCFG9_POSN                        equ 0001h
ANCON1_PCFG9_POSITION                    equ 0001h
ANCON1_PCFG9_SIZE                        equ 0001h
ANCON1_PCFG9_LENGTH                      equ 0001h
ANCON1_PCFG9_MASK                        equ 0002h
ANCON1_PCFG10_POSN                       equ 0002h
ANCON1_PCFG10_POSITION                   equ 0002h
ANCON1_PCFG10_SIZE                       equ 0001h
ANCON1_PCFG10_LENGTH                     equ 0001h
ANCON1_PCFG10_MASK                       equ 0004h
ANCON1_PCFG11_POSN                       equ 0003h
ANCON1_PCFG11_POSITION                   equ 0003h
ANCON1_PCFG11_SIZE                       equ 0001h
ANCON1_PCFG11_LENGTH                     equ 0001h
ANCON1_PCFG11_MASK                       equ 0008h
ANCON1_PCFG12_POSN                       equ 0004h
ANCON1_PCFG12_POSITION                   equ 0004h
ANCON1_PCFG12_SIZE                       equ 0001h
ANCON1_PCFG12_LENGTH                     equ 0001h
ANCON1_PCFG12_MASK                       equ 0010h
ANCON1_VBG2EN_POSN                       equ 0006h
ANCON1_VBG2EN_POSITION                   equ 0006h
ANCON1_VBG2EN_SIZE                       equ 0001h
ANCON1_VBG2EN_LENGTH                     equ 0001h
ANCON1_VBG2EN_MASK                       equ 0040h
ANCON1_VBGEN_POSN                        equ 0007h
ANCON1_VBGEN_POSITION                    equ 0007h
ANCON1_VBGEN_SIZE                        equ 0001h
ANCON1_VBGEN_LENGTH                      equ 0001h
ANCON1_VBGEN_MASK                        equ 0080h
ANCON1_PCFG14_POSN                       equ 0006h
ANCON1_PCFG14_POSITION                   equ 0006h
ANCON1_PCFG14_SIZE                       equ 0001h
ANCON1_PCFG14_LENGTH                     equ 0001h
ANCON1_PCFG14_MASK                       equ 0040h
ANCON1_PCFG15_POSN                       equ 0007h
ANCON1_PCFG15_POSITION                   equ 0007h
ANCON1_PCFG15_SIZE                       equ 0001h
ANCON1_PCFG15_LENGTH                     equ 0001h
ANCON1_PCFG15_MASK                       equ 0080h

// Register: DSWAKEL
#define DSWAKEL DSWAKEL
DSWAKEL                                  equ 0F4Ah
// bitfield definitions
DSWAKEL_DSPOR_POSN                       equ 0000h
DSWAKEL_DSPOR_POSITION                   equ 0000h
DSWAKEL_DSPOR_SIZE                       equ 0001h
DSWAKEL_DSPOR_LENGTH                     equ 0001h
DSWAKEL_DSPOR_MASK                       equ 0001h
DSWAKEL_DSMCLR_POSN                      equ 0002h
DSWAKEL_DSMCLR_POSITION                  equ 0002h
DSWAKEL_DSMCLR_SIZE                      equ 0001h
DSWAKEL_DSMCLR_LENGTH                    equ 0001h
DSWAKEL_DSMCLR_MASK                      equ 0004h
DSWAKEL_DSRTC_POSN                       equ 0003h
DSWAKEL_DSRTC_POSITION                   equ 0003h
DSWAKEL_DSRTC_SIZE                       equ 0001h
DSWAKEL_DSRTC_LENGTH                     equ 0001h
DSWAKEL_DSRTC_MASK                       equ 0008h
DSWAKEL_DSWDT_POSN                       equ 0004h
DSWAKEL_DSWDT_POSITION                   equ 0004h
DSWAKEL_DSWDT_SIZE                       equ 0001h
DSWAKEL_DSWDT_LENGTH                     equ 0001h
DSWAKEL_DSWDT_MASK                       equ 0010h
DSWAKEL_DSULP_POSN                       equ 0005h
DSWAKEL_DSULP_POSITION                   equ 0005h
DSWAKEL_DSULP_SIZE                       equ 0001h
DSWAKEL_DSULP_LENGTH                     equ 0001h
DSWAKEL_DSULP_MASK                       equ 0020h
DSWAKEL_DSFLT_POSN                       equ 0007h
DSWAKEL_DSFLT_POSITION                   equ 0007h
DSWAKEL_DSFLT_SIZE                       equ 0001h
DSWAKEL_DSFLT_LENGTH                     equ 0001h
DSWAKEL_DSFLT_MASK                       equ 0080h

// Register: DSWAKEH
#define DSWAKEH DSWAKEH
DSWAKEH                                  equ 0F4Bh
// bitfield definitions
DSWAKEH_DSINT0_POSN                      equ 0000h
DSWAKEH_DSINT0_POSITION                  equ 0000h
DSWAKEH_DSINT0_SIZE                      equ 0001h
DSWAKEH_DSINT0_LENGTH                    equ 0001h
DSWAKEH_DSINT0_MASK                      equ 0001h

// Register: DSCONL
#define DSCONL DSCONL
DSCONL                                   equ 0F4Ch
// bitfield definitions
DSCONL_RELEASE_POSN                      equ 0000h
DSCONL_RELEASE_POSITION                  equ 0000h
DSCONL_RELEASE_SIZE                      equ 0001h
DSCONL_RELEASE_LENGTH                    equ 0001h
DSCONL_RELEASE_MASK                      equ 0001h
DSCONL_DSBOR_POSN                        equ 0001h
DSCONL_DSBOR_POSITION                    equ 0001h
DSCONL_DSBOR_SIZE                        equ 0001h
DSCONL_DSBOR_LENGTH                      equ 0001h
DSCONL_DSBOR_MASK                        equ 0002h
DSCONL_ULPWDIS_POSN                      equ 0002h
DSCONL_ULPWDIS_POSITION                  equ 0002h
DSCONL_ULPWDIS_SIZE                      equ 0001h
DSCONL_ULPWDIS_LENGTH                    equ 0001h
DSCONL_ULPWDIS_MASK                      equ 0004h

// Register: DSCONH
#define DSCONH DSCONH
DSCONH                                   equ 0F4Dh
// bitfield definitions
DSCONH_RTCWDIS_POSN                      equ 0000h
DSCONH_RTCWDIS_POSITION                  equ 0000h
DSCONH_RTCWDIS_SIZE                      equ 0001h
DSCONH_RTCWDIS_LENGTH                    equ 0001h
DSCONH_RTCWDIS_MASK                      equ 0001h
DSCONH_DSULPEN_POSN                      equ 0001h
DSCONH_DSULPEN_POSITION                  equ 0001h
DSCONH_DSULPEN_SIZE                      equ 0001h
DSCONH_DSULPEN_LENGTH                    equ 0001h
DSCONH_DSULPEN_MASK                      equ 0002h
DSCONH_DSEN_POSN                         equ 0007h
DSCONH_DSEN_POSITION                     equ 0007h
DSCONH_DSEN_SIZE                         equ 0001h
DSCONH_DSEN_LENGTH                       equ 0001h
DSCONH_DSEN_MASK                         equ 0080h

// Register: DSGPR0
#define DSGPR0 DSGPR0
DSGPR0                                   equ 0F4Eh
// bitfield definitions
DSGPR0_DSGPR0_POSN                       equ 0000h
DSGPR0_DSGPR0_POSITION                   equ 0000h
DSGPR0_DSGPR0_SIZE                       equ 0008h
DSGPR0_DSGPR0_LENGTH                     equ 0008h
DSGPR0_DSGPR0_MASK                       equ 00FFh

// Register: DSGPR1
#define DSGPR1 DSGPR1
DSGPR1                                   equ 0F4Fh
// bitfield definitions
DSGPR1_DSGPR1_POSN                       equ 0000h
DSGPR1_DSGPR1_POSITION                   equ 0000h
DSGPR1_DSGPR1_SIZE                       equ 0008h
DSGPR1_DSGPR1_LENGTH                     equ 0008h
DSGPR1_DSGPR1_MASK                       equ 00FFh

